In [1]:
import pandas as pd

df = pd.read_csv('../data/Meteorite_Landings_20241105.csv')
df.head()

,name,id,nametype,recclass,mass (g),fall,year,reclat,reclong,GeoLocation
0,Aachen,1,Valid,L5,21.0,Fell,1880.0,50.77500,6.08333,"(50.775, 6.08333)"
1,Aarhus,2,Valid,H6,720.0,Fell,1951.0,56.18333,10.23333,"(56.18333, 10.23333)"
2,Abee,6,Valid,EH4,107000.0,Fell,1952.0,54.21667,-113.00000,"(54.21667, -113.0)"
3,Acapulco,10,Valid,Acapulcoite,1914.0,Fell,1976.0,16.88333,-99.90000,"(16.88333, -99.9)"
4,Achiras,370,Valid,L6,780.0,Fell,1902.0,-33.16667,-64.95000,"(-33.16667, -64.95)"

In [2]:
print(df.dtypes)

name            object
id               int64
nametype        object
recclass        object
mass (g)       float64
fall            object
year           float64
reclat         float64
reclong        float64
GeoLocation     object
dtype: object

In [3]:
df.isna().sum()

name              0
id                0
nametype          0
recclass          0
mass (g)        131
fall              0
year            291
reclat         7315
reclong        7315
GeoLocation    7315
dtype: int64

In [4]:
df = df.dropna()

In [5]:
df['year'] = df['year'].astype(int)

In [6]:
df.describe()

                 id      mass (g)          year        reclat       reclong
count  38115.000000  3.811500e+04  38115.000000  38115.000000  38115.000000
mean   25343.139000  1.560071e+04   1989.993913    -39.596529     61.309359
std    17395.360205  6.286817e+05     25.469892     46.175830     80.777583
min        1.000000  0.000000e+00    860.000000    -87.366670   -165.433330
25%    10831.500000  6.630000e+00   1986.000000    -76.716670      0.000000
50%    21732.000000  2.909000e+01   1996.000000    -71.500000     35.666670
75%    39887.500000  1.872900e+02   2002.000000      0.000000    157.166670
max    57458.000000  6.000000e+07   2101.000000     81.166670    178.200000

In [7]:
df = df[df['year'] <= 2024]

In [8]:
df.describe()

                 id      mass (g)          year        reclat       reclong
count  38114.000000  3.811400e+04  38114.000000  38114.000000  38114.000000
mean   25342.304481  1.560111e+04   1989.991001    -39.597567     61.310968
std    17394.825419  6.286900e+05     25.463878     46.175991     80.778032
min        1.000000  0.000000e+00    860.000000    -87.366670   -165.433330
25%    10831.250000  6.630000e+00   1986.000000    -76.716670      0.000000
50%    21731.500000  2.908500e+01   1996.000000    -71.500000     35.666670
75%    39886.500000  1.873350e+02   2002.000000      0.000000    157.166670
max    57458.000000  6.000000e+07   2013.000000     81.166670    178.200000

In [9]:
print(df.shape)

(38114, 10)

In [10]:
df.to_csv('../data/Meteorite_Landings_20241105_cleaned.csv', index=False)